app/controllers/home_controller.rb

  def show
    if logged_in? && !params[:id]
      track_visit
      render "feed/show", :layout => "application"
    elsif params[:invited_by]
      session[:invited_by_user_id] = Cryptography.deobfuscate params[:invited_by]
      session[:origin] = "invite"

      redirect_to root_path
    else
      detect_origin
      redirect_to root_path if params[:id]

      if session[:invited_by_user_id]
        @invited_by_user = User.find session[:invited_by_user_id]
---
SELECT * FROM `users` WHERE (`users`.`id` = 3) LIMIT 1