app/controllers/products_controller.rb

  def show

    if params[:id].present?
      product = Product.find(params[:id])
      redirect_to product_path(product.user.handle,product.handle)
      return
    end


    @source   = params[:src] ? params[:src].to_s : "direct"

    user      = User.find_by_handle(params[:user_handle])
    @product  = Product.with_store.with_user.find_by_user_id_and_handle(
                          user.id,
                          params[:product_handle])


    @next_product  = @product.next
    @next_product  ||= @product.user.products.first
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1