app/controllers/share_controller.rb

  def create
    product = Product.eager.find(params[:product_id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 52)